# Assign Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudColorSettings..::..Assign Method
PointCloudColorSettings Class See Also
---
Assigns values of the source settings to this object.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void Assign(
	PointCloudColorSettings other
)
```

Visual Basic
---
```text
Public Sub Assign ( _
	other As PointCloudColorSettings _
)
```

Visual C++
---
```text
public:
void Assign(
	PointCloudColorSettings^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.PointClouds..::..PointCloudColorSettings The source settings.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PointCloudColorSettings Class
Autodesk.Revit.DB.PointClouds Namespace